jrichter24/moldqueen/esp32-core/sdkconfig.defaults
# Defaults for the Heemol ESP32-S3 N16R8 DevKitC-1 (16 MB flash, 8 MB octal PSRAM).
# The test session found a fresh project defaults to 2MB / no-PSRAM — set these
# correctly from the start so the real radio core has the flash + PSRAM it needs.

CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash (the "N16")
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 8 MB octal PSRAM (the "R8")
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
